{
    "name" : "Ming Ye",
    "title" : "Product Designer",
    "statement" : "I build solutions for complex workflows that drive measurable impact.",
    "workExperience": [
        {
            "jobTitle" : "Senior UX / UI Designer", 
            "companyName" : "Yext", 
            "year" : "May 2023 - Present", 
            "jobSummary": [
                "Led the design of the reusable component library and configurable prop system for an enterprise site builder, shortening time-to-launch by 20 weeks.",
                "Led end-to-end design of enterprise CMS solutions for global brands such as RBC, Accor, Heartland Dental.",
                "Drove research initiatives including heuristic audits, usage analytics, and workflow mapping to inform design decisions.",
                "Designed and implemented workflow automation via a custom Figma plugin, reducing manual work by 3+ hours per project across a team of four designers."
            ]
        },
        {
            "jobTitle" : "UX / UI Designer", 
            "companyName" : "Yext", 
            "year" : "August 2019 - May 2023", 
            "jobSummary": [
                "Led design execution for clients with complex business requirements.",
                "Completed Engineering onboarding to bridge cross-team collaborations"
            ]
        },
        {
            "jobTitle" : "Community Assistant / Leasing Consultant", 
            "companyName" : "Greystar", 
            "year" : "February 2017 - November 2018", 
            "jobSummary": [
                "Conducted property tours and guided prospective residents through the leasing process from initial contact to move-in.",
                "Achieved leasing goals by applying effective sales strategies.",
                "Provided customer service by addressing resident questions and concerns"
            ]
        }
    ],
    "contact" : [
        {
                "entryTitle" : "Email",
                "entryDetails" : "mingxinye1128@gmail.com"
        },
        {
                "entryTitle" : "Website",
                "entryDetails" : "mingxinye.com"
        },
        {
                "entryTitle" : "Phone",
                "entryDetails" : "720-785-4667"
        },
        {
                "entryTitle" : "Location",
                "entryDetails" : "Rockville, MD"
        }
    ],
    "profileSummary" : [
        {   "sectionTitle" : "Skills",
            "sectionDetails" : [
            {
                "entryTitle" : "Design",
                "entryDetails" : "Figma, System Thinking, Prototyping, Accessibility, User Research, User Testing"
            },
            {
                "entryTitle" : "Programming",
                "entryDetails" : "React, HTML5, CSS, JavaScript, Cursor, GitHub Copilot"
            }
        ]},
        {   "sectionTitle" : "Education & Certifications",
            "sectionDetails" : [
            {
                "entryTitle" : "Principles of User Experience Research & Testing",
                "entryDetails" : "RIVA Training Institute"
            },
            {
                "entryTitle" : "Nano Degree in Front End Web Developer",
                "entryDetails" : "Udacity Nanodegree Program"
            },
            {
                "entryTitle" : "B.S. Computer Science & B.A. Graphic Design",
                "entryDetails" : "University of Maryland, College Park"
            }
        ]}
    ],
    "projectExperience": [
        {
            "projectTitle" : "Figma Tool for Content and Metadata Annotations & Extraction", 
            "companyName" : "Yext", 
            "year" : "2025 - 2026", 
            "projectSummary": [
                "Designed and built a Figma plugin to automate design content scanning and metadata definition.",
                "Identified user pain points by analyzing existing workflows and refining the MVP through billable projects.",
                "Reduced manual annotation and spreadsheet creation by 3 hours per project across a team of four designers."
            ]
        },
        {
            "projectTitle" : "Enterprise Content & Site Building Platform", 
            "companyName" : "Yext", 
            "year" : "2026", 
            "projectSummary": [
                "Defined the architecture of a reusable component library and customizable framework that balanced branding consistency with engineering efficiency.",
                "Led the design of configurable prop system, enabling scalable template development and shortening time-to-launch by 20 weeks.",
                "Embedded WCAG-AA accessibility into page generation workflows, ensuring compliance for enterprise clients.",
                "Influenced product roadmap prioritization and strategy."
            ]
        }
    ]
}