{
    "headerData" : [
        {
            "linkText":"My Work",
            "url":".."
        },
        {
            "linkText":"Resume",
            "url":"resume"
        },
        {
            "linkText":"Outside Work",
            "url":"outsideWork"
        }
    ],
    "footerData" : [
        {
            "type":"linkedIn",
            "url":"https://www.linkedin.com/in/mingxinye",
            "imgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/LinkedIn_logo.png"
        },
        {
            "type":"instagram",
            "url":"https://www.instagram.com/mmingaling/",
            "imgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/Instagram_logo.png"
        },
        {
            "type":"email",
            "url":"mailto:mingxinye1128@gmail.com",
            "imgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/email.png"
        }
    ],
    "pageInfo" : {
        "portfolio" : {
            "url":"..",
            "title" : "My Work",
            "profileImgUrl": "https://portfoliocontent.blob.core.windows.net/portolioimages/profileImage.png",
            "description" : "I’m a Full Stack Designer who creates high-quality digital products to help businesses and their users achieve their goals. With my background in design and programming, I serve as a bridge between users, designers, and developers. I approach every problem with empathy, curiosity, and positivity to find a win-win solution.",
            "buttonGroup":[
                {
                    "buttonText": "Scroll to See My Work",
                    "buttonType" : "scrollTo"
                },
                {
                    "buttonText" : "Access My Resume",
                    "buttonType" : "link",
                    "buttonUrl" : "resume"
                },
                {
                    "buttonText" : "Connect with Me Outside Work",
                    "buttonType" : "link",
                    "buttonUrl" : "outsideWork"
                }
            ]
        },
        "resume" : {
            "url":"resume",
            "title" : "Resume",
            "description" : "Read more about my working experience in my resume below. Whether you are a fellow tech ethusiast or someone who's seeking talent, feel free to reach out. I'd love to connect and explore how we might collaborate!",
            "buttonGroup":[
                {
                    "buttonText" : "Save Resume as PDF",
                    "buttonType" : "print",
                    "buttonUrl" : ""
                },
                {
                    "buttonText" : "Connect Via Email",
                    "buttonType" : "link",
                    "buttonUrl" : "mailto:mingxinye1128@gmail.com"
                }
            ]

        },
        "outsideWork" : {
            "url":"outsideWork",
            "title" : "Connect Outside Work",
            "description" : "When I'm not working, I enjoy listening to audio books, playing word puzzles and going on food adventures. You can also find me on the tennis court during summer, ski slops during winter, or climbing gyms all year round.",
            "buttonGroup":[
                {
                    "buttonText" : "CONNECT ON INSTAGRAM",
                    "buttonType" : "link",
                    "buttonUrl" : "https://www.instagram.com/mmingaling/"
                },
                {
                    "buttonText" : "CONNECT ON LINKEDIN",
                    "buttonType" : "link",
                    "buttonUrl" : "https://www.linkedin.com/in/mingxinye?original_referer=http%3A%2F%2Flocalhost%3A8080%2F"
                }
            ]
        }
    },
    "projectData" : [ 
        {
            "projectName" : "Trane Supply Products & Parts Search Site",
            "projectDescription" : "To design an e-commerce search experience that helps business agents and customers find the products or parts they are looking for.",
            "projectDuration" : "4 month, August 2022 - Dec 2022",
            "projectProblem" : "With millions of products offered by the buisiness, accessing product information was a cumbersome process. Agents must have a precise knowledge of where to look and navigate through multiple databases and platforms, manually connecting the dots to find the right information. The goal of the project is to transform its e-commerce site and streamline the part-finding process so it provides a effortless shopping experience for both HVAC agents and customers.",
            "projectImpact": "We streamlined and simplified the part-finding journey by creating a search experience that consolidates related information from multiple databases into a single, cohesive web interface, ultimately reducing the time it takes for agents and customers to find the part.",
            "myResponsibilities":[
                "Created high-fidelity designs",
                "Collaborated with the client team and Yext engineers to develop technical solutions",
                "Worked with Trane UX researchers to conduct usability testing",
                "Led internal design brainstorming sessions"
            ],
            "projectCoverImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/Trane/trane-project-cover.png",
            "projectPageUrl" : "trane-supply-search-site",
            "understandingUsers" : {
                "sectionHeading" : "Understanding Users",
                "sectionDescription": "",
                "sectionImgUrl":"",  
                "infoBlocks": [
                    {
                        "blockHeading": "The client provided a variety of user types at the start of the project. Each group has varying levels of access to existing database, leading to different search behaviors and feature requirements.",
                        "blockBulletPoints":  [ 
                            "Remote agents who interact with customers over the phone",
                            "Storefront agents who engage with customers in person",
                            "HVAC professionals who purchase parts from Trane.",
                            "Unauthenticated customers interested in purchasing parts from Trane"
                        ]
                    },
                    {
                        "blockHeading": "User Painpoints",
                        "blockDescription": "",
                        "blockBulletPoints":  [
                            "Product information was hosted in separate databases and on different platforms. Agents had to log into multiple platforms and connect the dots manually to find the product they are looking for.",
                            "This clunky setup requires an agent to have extensive and percise knowledge of where each piece of data is located and how to find them."
                        ]
                    },
                    {
                        "blockHeading": "Competitive Analysis",
                        "blockDescription": "To gain deeper market insights, we also conducted a competitive analysis of direct competitors, identifying common layouts and design patterns across their competitors.", 
                        "blockBulletPoints":  [
                        ],
                        "blockImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/Trane/trane-1.png"
                    }
                ]
            },
            "startDesign":{
                "sectionHeading" : "Design Iteration",
                "sectionDescription": "Starting with user stories, the entire project team met to gather business requirements, discuss user needs, business goals, and define the technical details for upcoming features.",
                "infoBlocks": [
                    {
                        "blockHeading": "Client Presentation - User Flow",
                        "blockDescription": "To make it easier to present and walk the client through the designs, we outlined user flows for each user story.",
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/Trane/trane-2.png"
                    },
                    {
                        "blockHeading": "Collaboration with Enigeers",
                        "blockDescription": "Once the requirements were handed off to us, we collaborated closely with engineers and project managers to define the scope, discuss technical solutions, and identify potential challenges.",
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/Trane/trane-3.png"
                    },
                    {
                        "blockHeading": "Design Team Brainstorm",
                        "blockDescription": "I also led brainstorming sessions that empowered our four-member design team to address challenging design requests and generate design solutions.",
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/Trane/trane-4.png"
                    }

                ]
            },
            "refineDesign":{
                "sectionHeading" : "Usability Study & Design Refinement",
                "sectionDescription": "Working with client's UX researchers, I've participated in usability study sessions to test out hi-fidelity mockups with end users",
                "sectionImgUrl": "https://portfoliocontent.blob.core.windows.net/portolioimages/Trane/trane-5.png",
                "infoBlocks": [
                ]
            },
            "takeaways":{
                "sectionHeading" : "Takeaways",
                "sectionDescription": "",
                "infoBlocks": [
                    {
                        "blockHeading": "Project Milestones",
                        "blockBulletPoints": [
                            "Three rapid product releases",
                            "Features were rolled out to the production environment in stages, tailored to user types",
                            "Continuous iterations and improvements occur simultaneously with the development of new features."
                        ]
                    },
                    {   "blockHeading": "What I Learned",
                        "blockBulletPoints": [
                            "In a rapid product development process, UX designers and engineers must collaborate closely.",
                            "When each role understands the other's language, ideas can flow more swiftly between teams.",
                            "Many projects can benefit from an additional role, such as UX engineers, that helps bridge the gap between designers and engineers."
                        ]
                    }
                ]
            }
        },

        {
            "projectName" : "App for Non-profit Organizers UX Research",
            "projectDescription" : "To design a mobile app that helps non-profit organizers more effectively track and manage notes, contacts and to-dos.",
            "projectDuration" : "4 month, August 2022 - Dec 2022",
            "projectProblem" : "The goal is to design a mobile app that helps non-profit organizers more effectively track and manage notes, contacts and to-dos.",
            "projectImpact": "The research gave us valuable insights into organizers' processes and pain points, directly shaping how we prioritized app features to create an effective MVP.",
            "myRole":"My design partner and I collaborated as a team of two to conduct user research and create wireframes that will serve as the blueprint for the app.",
            "myResponsibilities":[
                "Conducted user research",
                "Developed personas and empathy maps, user stories",
                "Proritize MVP app features and created initial userflow"
            ],
            "projectCoverImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/OrganizingApp-project-cover.png",
            "projectPageUrl" : "app-for-non-profit-organizers",
            "understandingUsers" : {
                "sectionHeading" : "Understanding Users",
                "sectionDescription": "",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/interview-notes.png",
                "infoBlocks": [
                    {
                        "blockHeading": "To better understand our users, we conducted hour-long Zoom interviews with three non-profit organizers. The interview was designed to answer the following questions:",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "What does their day-to-day look like?",
                            "What pain points do they encounter in their job responsibilities?",
                            "What tools are they currently using?",
                            "What do they like and dislike about those tools?"
                        ]
                    },
                    {
                        "blockHeading": "User Painpoints",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "Organizers frequently find it challenging to take notes while engaging with community members. As a result, note-taking is often deferred until after the conversation, leading to a rushed and potentially incomplete capture of information.",
                            "Some community members don't speak fluent English, leading to communication barriers and misunderstandings.",
                            "Organizers frequently manage multiple cases over extended periods, making it difficult to update statuses, organize notes, and track to-dos efficiently.",
                            "When cases are handed off between organizers, disorganized notes can result in a lack of context and delays in service delivery."
                        ]
                    },
                    {
                        "blockHeading": "User Persona",
                        "blockDescription": "Based on the interview, we created 3 user persona to help empathize with our users.", 
                        "blockBulletPoints":  [],
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/user-persona.png"
                    },
                    {
                        "blockHeading": "Empathy Map",
                        "blockDescription": "We also built user empathy maps for different stages of a organizer's work flow.", 
                        "blockBulletPoints":  [],
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/empathy-map.png"
                    },
                    {
                        "blockHeading": "User Story & Feature Planning",
                        "blockDescription": "Based on the insights we gathered, we developed user stories using Ad-lib and prioritized the app features for the MVP.",
                        "blockBulletPoints": [],
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/feature-planning.png"
                    }
                ]
            },
            "startDesign":{
                "sectionHeading" : "User Flow",
                "sectionDescription": "We are currently at the beginning stage of the design phrase. We started drawing out the user flow chart and defining screens for each features.",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/user-flow.png",
                "infoBlocks": []
            },
            "takeaways":{
                "sectionHeading" : "Takeaways",
                "sectionDescription": "",
                "infoBlocks": [
                    {
                        "blockHeading": "Next Steps",
                        "blockBulletPoints": [
                            "Convert digital wireframes into interactive prototypes and conduct usability testing to gather actionable feedback.",
                            "Shadow organizers for a day to observe real-world user behavior",
                            "Refine the design based on research findings"

                        ]},
                    {
                        "blockHeading": "What I Learned",
                        "blockDescription": "Initial user research revealed that users could benefit from various app features, such as a built-in calendar for tracking events and translators to facilitate interactions with specific community members. However, as we developed user stories, we realized the importance of focusing on features that deliver the most value and address key gaps in users' daily workflows. This prompted us to prioritize and narrow down a core set of functionalities for the MVP."
                    }
                ]
            }
        },
        {
            "projectName" : "Heartland Dental Office Microsite Platform Solution",
            "projectDescription" : "To design and refine six dental office website templates that adapt to the branding of 100+ practices, with dark mode integration.",
            "projectDuration" : "",
            "projectProblem" : "Managing a dental practice involves numerous responsibilities. Effective marketing is a crucial aspect. However, these non-dental-related tasks can often divert dentists' attention from their primary focus—caring for patients. The project aims to help hundreds of dentists Heartland partners reduce their workload of maintaining their digital presence.",
            "projectImpact": "We successfully launched over a hundred of dentist websites using five of the six templates, receiving praise from the client team for the execution of the solution. Local dental offices also provided positive feedback on the user-friendly experience we delivered.",
            "myResponsibilities":[
                "Led brainstorming sessions with the client team to align on design requirements and explore innovative branding applications for the front-end",
                "Collaborated with the client to identify practical platform solutions tailored to their marketing team’s workflow",
                "Developed high-fidelity mockups for six templates, each featuring seven unique pages",
                "Integrated Figma variables into mockups, ensuring that live pages meet WCAG standards, regardless of branding colors"
            ],
            "projectCoverImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/Heartland/heartland-project-cover.png",
            "projectPageUrl" : "heartland-dental-office-microsite-platform-solution-template",
            "understandingUsers" : {
                "sectionHeading" : "Understanding Users",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "There are multiple stakeholders to consider in the design process, each benefiting from various aspects of the solution package.",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "Patients, who are browsing the sites for a new dentist or booking follow-up visits with their existing providers",
                            "Dentists, who seek greater customization options for content on their sites",
                            "Heartland teams, who are active managing dentists' listsings and websites"
                        ]
                    }
                ]
            },
            "startDesign":{
                "sectionHeading" : "Team Collaboration & Solution Brainstorm",
                "sectionDescription": "",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/Heartland/heartland-project-1.png",
                "infoBlocks": [
                    {
                        "blockHeading": "Finding the right solution",
                        "blockBulletPoints": [
                            "Led and participated in multiple requirements sessions to gain a deeper understanding of business operations, requirements, and goals.",
                            "Collaborated with developers to explore various solutions for dynamically mapping content and color variables to the templates.",
                            "Mapped out user flows to visualize the process of launching a new site within the platform."
                        ],
                        "blockImgUrl": ""
                    },
                    {
                        "blockHeading": "Competitive Analysis & Wireframes",
                        "blockBulletPoints": [
                            "Led UI competitive analysis sessions to gain insights into market trends.",
                            "Facilitated wireframing sessions to quickly generate and explore design ideas."
                        ],
                        "blockImgUrl": "https://portfoliocontent.blob.core.windows.net/portolioimages/Heartland/heartland-project-2.png"
                    }
                ]
            },
            "refineDesign":{
                "sectionHeading" : "Figma Variables & Component Library",
                "sectionDescription": "",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/Heartland/heartland-project-3.png",
                "infoBlocks": [
                    {
                        "blockHeading": "",
                        "blockBulletPoints": [ 
                            "Created Figma variables to test color application, accessibility, and dark mode functionality.",
                            "Carefully organized, defined, and reused design components to emphasize data variability while minimizing the creation of excessive new components.",
                            "Developed high-fidelity mockups that are scalable and easily maintainable in the long term."
                        ],
                        "blockImgUrl": ""
                    }
                ]
            },
            "takeaways":{
                "sectionHeading" : "Takeaways",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "Next Steps",
                        "blockBulletPoints": [
                            "Continue monitoring site analytics to extract helpful insight on page performance and iterating on content and designs.",
                            "Design and develope listing management dashboard to help Heartland team members manage multiple listings more efficiently"
                        ]
                    },
                    {
                        "blockHeading": "What I Learned",
                        "blockDescription": "When there are numerous stakeholders and users to consider, clearly defining the needs of each persona allows the team to tailor solutions that effectively address specific pain points. For instance, dentists may prioritize the visibility of their bios on the page, while patients focus on easily finding office information and new patient forms. Additionally, the team responsible for implementing the website may advocate for streamlined site management, whereas marketing personnel and dentists might request more flexibility in customization options. This level of clarity will also assist in prioritizing the next steps in the development process."
                    }
                ]
            }
        },

        {
            "projectName" : "Dashboard Template",
            "projectDescription" : "To create a Figma template and component repository that empowers designers to efficiently craft custom dashboard designs while ensuring consistency and standardization across the board.",
            "projectDuration" : "1 month, April 2022 - May 2022",
            "projectProblem" : "With the influx of dashboard projects, designers frequently start each design file from scratch, leading to inefficiencies, inconsistencies across designs, and maintenance challenges. The goal is to create a Figma template and component repository that empowers designers to efficiently craft custom dashboard designs while ensuring consistency and standardization across the board.",
            "projectImpact": "The Figma template and component repository significantly reduced the time needed to build custom dashboards. Experienced designers can now focus on creating intuitive in-platform experiences for our customers, rather than building components from scratch, while new hires can get started quickly, relying less on tenured designers for guidance.",
            "myRole": ["UX researcher", "UX Designer"],
            "myResponsibilities": [
                "Conducted user research to gather insights",
                "Turned user insights into design actions",
                "Developed a comprehesive design template and component library",
                "Collected feedback on the update template"
            ],
            "projectCoverImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/DashboardTemplate/dashboard-template-cover.png",
            "projectPageUrl" : "dashboard-template",          
            "understandingUsers" : {
                "sectionHeading" : "Understanding Users",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "To gain deeper insights into the current dashboard building experience and reduce my designer bias, I interviewed four other designers:",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "2 new hires who has been with the company for less than 1 year",
                            "2 tenured colleagues who have been with the company for over 1 year"
                        ]
                    },
                    {
                        "blockHeading": "The interview was designed to answer the following questions",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "What is their current workflow when it comes to designing the dashboard?",
                            "What are their painpoints when it comes to building a dashboard design?",
                            "What are some examples of dashboard they’ve built recently?"
                        ]
                    },
                    {
                        "blockHeading": "User Painpoints",
                        "blockDescription": "",
                        "blockBulletPoints":  [
                            "Building from ground zero or relying on previous examples to set up design files",
                            "Junior designers are often unfamiliar with the platform's capabilities and unsure whether a component is available out-of-the-box or needs to be custom-designed",
                            "Designers often need to manipulate screenshots by cropping, covering, or combining images to save time."
                        ],
                        "blockImgUrl": "https://portfoliocontent.blob.core.windows.net/portolioimages/DashboardTemplate/dashboard-template-1.png"
                    }
                ]
            },
            "startDesign":{
                "sectionHeading" : "Design Iteration",
                "sectionDescription": "",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/DashboardTemplate/dashboard-template-2.png",
                "infoBlocks": [
                    {
                        "blockHeading": "Building a Component Library",
                        "blockBulletPoints": [
                            "Audited existing client dashboard examples and compiled a list of common modules used across designs.",
                            "Improve file organization by grouping components based on the functionality of the modules.",
                            "Consulted with product designers to identify opportunities for aligning our designs with their design systems",
                            "Consulted with engineers to understand each module's customizability during development and integrated them into the components."
                        ]
                    }
                ]
            },
            "refineDesign":{
                "sectionHeading" : "Usability Study & Design Refinement",
                "sectionDescription": "",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/DashboardTemplate/dashboard-template-3.png",
                "infoBlocks": [
                    {
                        "blockHeading": "Once I built out the first draft of the component library, I went on to test the template with the same set of designers. I asked them to complete the following tasks:",
                        "blockBulletPoints": [
                            "Review the Entire File: Provide an initial impression based on the overall organization, clarity, and usability of the file.",
                            "Find a Specific Module: Locate a specific module using only its name to assess ease of navigation",
                            "Inspect Customizable Modules: Evaluate the customizable modules and provide initial feedback on their flexibility and ease of use."
                        ]
                    },
                    {
                        "blockHeading": "Userbility Test Findings",
                        "blockBulletPoints": [
                            "Participants appreciated that the page layout resembles other files we use.",
                            "They found the dashboard mockup page overwhelming due to the numerous modules displayed on a single page.",
                            "Participants requested additional descriptions or annotations next to the components to aid the navigation of the file.",
                            "They had differing opinions on how to organize and manage modules after a custom dashboard is built, such as whether to delete unused modules or save them for future use."
                        ]
                    },
                    {
                        "blockHeading": "Based on feedback, I incorporated the following changes to the template",
                        "blockBulletPoints": [
                            "Separated the three sets of modules into different Figma pages to reduce information overload.",
                            "Added descriptions on each page to help designers, particularly new hires, become familiar with the platform's capabilities.",
                            "Included annotations to explain complex components and how to use them."]
                    }
                ]
            },
            "takeaways":{
                "sectionHeading" : "Takeaways",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "Next Steps",
                        "blockBulletPoints": [
                            "Follow up with designers who have used the template to gather additional user feedback",
                            "Continue discussions with the team on best practices for maintaining each dashboard file",
                            "Create a dedicated space for ongoing conversations about maintaining the template and component library as the platform evolves"
                        ]
                    },
                    {
                        "blockHeading": "What I Learned",
                        "blockBulletPoints": [
                            "Set aside my personal biases and preferences so I can address problems from the perspective of my users",
                            "Design operations, such as building a template to enhance design efficiency, require long-term commitments to continuous iteration and collaboration across the entire team."
                        ]
                    }
                ]
            }
        },

        {
            "projectName" : "Merrill Finacial Advisor Page Redesign",
            "projectDescription" : "The goal is to help prospective customers learn more about Bank of America advisors while enabling bank advisors to efficiently manage the content on their personal pages. Details are coming soon.",
            "projectDuration" : "4 month, August 2022 - Dec 2022",
            "projectProblem" : "Details are coming soon.",
            "projectImpact": "",
            "myResponsibilities":[
            ],
            "projectCoverImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/Merrill/merrill-cover.png",
            "projectPageUrl" : "merrill-finacial-advisor-page-redesign",
            "understandingUsers" : {
                "sectionHeading" : "",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                        ]
                    },
                    {
                        "blockHeading": "",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                        ]
                    },
                    {
                        "blockHeading": "",
                        "blockDescription": "",
                        "blockBulletPoints":  [
                        ]
                    }
                ]
            },
            "startDesign":{
                "sectionHeading" : "",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "",
                        "blockBulletPoints": [
                        ]
                    },
                    {
                        "blockHeading": "",
                        "blockBulletPoints": [
                        ]
                    }
                ]
            },
            "refineDesign":{
                "sectionHeading" : "",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "",
                        "blockBulletPoints": [  
                        ]
                    }
                ]
            },
            "takeaways":{
                "sectionHeading" : "Takeaways",
                "sectionDescription": "",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "Next Steps",
                        "blockBulletPoints": []
                    },
                    {
                        "blockHeading": "What I Learned",
                        "blockDescription": ""
                    }
                ]
            }
        },

        {
            "projectName" : "The UPS Store Mircrosite Redesign",
            "projectDescription" : "To revamp the UPS Store Microsite template including the location page, service page and search site to streamline the user experience, minimizing friction in the UI and enhancing navigation. Details are coming soon.",
            "projectDuration" : "4 month, August 2022 - Dec 2022",
            "projectProblem" : "Details are coming soon.",
            "projectImpact": "",
            "myResponsibilities":[
                "Examined the UPS Store search site using heuristic evaluation and web analytics",
                "Conducted user testing on the UPS Store search site",
                "Built audit reports based on the user testing result",
                "Provided design recommendations based on the report insights"
            ],
            "projectCoverImgUrl" : "https://portfoliocontent.blob.core.windows.net/portolioimages/TUPSS/TUPSS-cover.png",
            "projectPageUrl" : "the-ups-store-mircrosite-redesign",
            "understandingUsers" : {
                "sectionHeading" : "Understanding Users",
                "sectionDescription": "The project team first started by conducting a thorough UX audit of the two sites. ",
                "sectionImgUrl":"",
                "infoBlocks": [
                    {
                        "blockHeading": "UX Audits & Usability Testing",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "For the location microsite, our team conducted an in-house competitive analysis. The UPS team also provided us with a third-party heuristic audit.",
                            "For the search site, our team conducted an in-house site analytics, usability testing, and heuristic audit of the search site."
                        ],
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/user-flow.png"
                    },
                    {
                        "blockHeading": "Location Microsite Findings",
                        "blockDescription": "", 
                        "blockBulletPoints":  [
                            "The inbound site navigation is confusing to users. Multiple header links lead to the same page content.",
                            "The complete list of services offered at each location is buried lower on the page. As a result, customers have difficulties figuring out whether a location offer a specific service.",
                            "The site branding differs significantly from the brand’s main domain UPS.com"
                        ],
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/user-flow.png"
                    },
                    {
                        "blockHeading": "Search Site Findings",
                        "blockDescription": "",
                        "blockBulletPoints":  [
                            "The search result only returns information about the current UPS store. This scope of the search, however, is not obvious to users. Customers are searching for non-location-specific information such as store finders or career at UPS",
                            "No-result screens are sometimes unhelpful. Search UI would state that filtering to another topic will return a matching result when we know the database doesn’t contain the relevant content.",
                            "The lack of search loading indication prompts users to refresh the page, especially at a slower page load speed."
                        ],
                        "blockImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/user-flow.png"
                    }
                ]
            },
            "refineDesign":{
                "sectionHeading" : "Design Iteration",
                "sectionDescription": "Based on the insight from the research, I incorporated the following changes to the template",
                "sectionImgUrl":"https://portfoliocontent.blob.core.windows.net/portolioimages/OrganzingApp/user-flow.png",  
                "infoBlocks": [
                    {
                        "blockHeading": "Header Navigation Restructure:",
                        "blockDescription": "To minimize confusion, we repositioned the breadcrumbs above the header on desktop and highlighted the current location on mobile, clarifying that the content is specific to the user's current location. Additionally, we added a location label in the header to emphasize that all links are local to the selected location."

                    },
                    {
                        "blockHeading": "Location Page Above-the-Fold Redesign:",
                        "blockDescription": "We revamped the above-the-fold section to make accessing services easier. The core business information is now the first tab in a tabbed layout, with the services list as the second tab. This allows users to quickly find relevant services with a single click, instead of needing to scroll through the page."
                    },
                    {
                        "blockHeading": "Search Scope Adjustment:",
                        "blockDescription": "Analyzing search data revealed that users typically look for services close to their physical location. To reduce confusion, we broadened the search scope to show results beyond a single location while prioritizing services nearest the user. We also introduced a 'My Store' button, automatically set to the closest location, allowing users to refine their search results based on their chosen store."
                    }
                ]
            },
            "takeaways":{
                "sectionHeading" : "Takeaways",
                "sectionDescription": "",
                "infoBlocks": [
                    {
                        "blockHeading": "Next Steps",
                        "blockBulletPoints": [
                            "Convert mockups to high-fidelity prototypes",
                            "Test prototype with users",
                            "Present to clients with research findings and further iterating on the designs"
                        ]
                    },
                    {
                        "blockHeading": "What I Learned",
                        "blockDescription": [
                            "A scoped search can reduce the amount of information users need to filter through, but it may confuse those unfamiliar with its limitations. By understanding user intent and adjusting the search scope to meet their expectations, we can minimize confusion and help users find what they need more efficiently."
                        ]
                    }
                ]
            }
        }
    ],
    "outsideWorkGallery" : [ 
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-1.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-2.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-3.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-4.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-5.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-6.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-7.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-8.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-9.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-10.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-11.png",
        "https://portfoliocontent.blob.core.windows.net/portolioimages/outside-design-image-12.png"
    ]
}
