{
    "summary":"I’m a Full Stack Designer who creates high-quality digital products to help businesses and their users achieve their goals. With my background in design and programming, I serve as a bridge between users, designers, and developers. I approach every problem with empathy, curiosity, and positivity to find a win-win solution.",
    "workExperience": [
        {
            "jobTitle" : "Senior UI/UX Designer", 
            "companyName" : "Yext", 
            "year" : "Aug. 2019 - Present", 
            "jobSummary": [
                "Led web-focused research and design projects for clients such as The UPS Store, Merrill Bank of America, and Swedish Providence Health",
                "Collaborated with client shareholders, project managers, and engineers to ensure the designs met all business requirements",
                "Onboarded into the Engineering team to act as the liaison between the design and engineering team",
                "Conducted interviews and improved Yext Professional Services design system",
                "Assisted the design manager in scoping and maintaining weekly scrum",
                "Interviewed designer candidates and onboarded new hires"
            ]
        },
        {
            "jobTitle" : "Web Designer & Developer", 
            "companyName" : "University of Maryland, College Park", 
            "year" : "Oct. 2018 - May 2019", 
            "jobSummary": [
                "Created website mockups for the University of Maryland Honors Colleges",
                "Transferred the mockups to interactive web pages with CSS, HTML, and Javascript"
            ]
        },
        {
            "jobTitle" : "Director of Design", 
            "companyName" : "Technica Hackathon, College Park", 
            "year" : "Sept. 2017 - Dec. 2017", 
            "jobSummary": [
                "Led a design team of 7 to produce marketing materials for the hackathon and its related events",
                "Coordinated with other organizing teams to provide attendees with the best-in-class Hackathon experiences"
            ]
        }
    ],
    "contact" : {
        "email" : "mingxinye1128@gmail.com",
        "Website" : "mingxinye.com"
    },
    "profileSummary" : [
        {   "sectionTitle" : "Skills",
            "sectionDetails" : [
            {
                "entryTitle" : "Design",
                "entryDetails" : "Figma, Sketch, User Research, User Testing, Prototyping, Adobe Creative Cloud"
            },
            {
                "entryTitle" : "Programming",
                "entryDetails" : "React, Webpack, HTML5, CSS, JavaScript"
            },
            {
                "entryTitle" : "Spoken Languages",
                "entryDetails" : "English, Mandarin"
            }
        ]},
        {   "sectionTitle" : "Certifications",
            "sectionDetails" : [
            {
                "entryTitle" : "Nano Degree in Front End Web Developer",
                "entryDetails" : "Udacity Nanodegree Programs"
            },
            {
                "entryTitle" : "Google UX Certificate",
                "entryDetails" : "7-course UX Certificate with Coursera "
            }
        ]},
        {   "sectionTitle" : "Education",
            "sectionDetails" : [
            {
                "entryTitle" : "B.S. Computer Science & B.A. Graphic Design",
                "entryDetails" : "University of Maryland, College Park 2015 - 2019"
            }
        ]}
    ],
    "projectExperience": [
        {
            "projectTitle" : "Heartland Dental Office Microsite Platform Solution", 
            "companyName" : "Yext", 
            "year" : "2023 - 2024", 
            "projectSummary": [
                "Built a design component library for each template",
                "Designed six high-fidelity, interchangeable Figma templates with seven pages each",
                "Collaborated with engineers and project managers to create innovative platform solutions",
                "Used Figma variables to enable dynamic branding updates for 100 dental sites without code changes"
            ]
        },
        {
            "projectTitle" : "The UPS Store Microsite Redesign", 
            "companyName" : "Yext", 
            "year" : "2022 - 2023", 
            "projectSummary": [
                "Examined the UPS Store search site using heuristic evaluation and web analytics",
                "Conducted user testing on the UPS Store search site",
                "Built audit reports based on the user testing result",
                "Provided design recommendations based on the report insights"
            ]
        },
        {
            "projectTitle" : "Trane Supplies Search Experience", 
            "companyName" : "Yext", 
            "year" : "2023", 
            "projectSummary": [
                "Gathered and finalized design requirements with clients and internal shareholders within an expedited timeline",
                "Researched and compared site features against competitors",
                "Collaborated with Engineers to rapidly iterate on live site prototypes"
            ]
        }
    ]
}